blog/2017/08/02/git-combine-commit-message/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
    <title>Git 合并多次提交 - 行走的西葫芦</title>
    <meta charset="utf-8" />
    <meta name="author" content="Dylan Yang" />
    <meta name="description" content="在合并分支的时候，希望将多次提交合并成一个，然后再 cherry-pick 到主分支。" />
    <meta name="keywords" content="Git, Commit, Rebase" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="/media/css/main.css" type="text/css">
    <link rel="stylesheet" href="/media/css/prettify-solarized-light.css" type="text/css">
    <link href="https://cdn.bootcss.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet">
  </head>

  <body class="container">
    <div>
      <header class="masthead">
        <form method="get" id="searchform" action="//www.google.com/search">
          <input type="text" class="field" name="q" id="s" placeholder="Search">
          <input type="hidden" name="as_sitesearch" value="zucchiniY.github.io">
        </form>
        <h1 class="masthead-title"><a href="/">行走的西葫芦</a></h1>
        <p>世事洞明皆学问，人情练达即文章。</p>
        <ul>
          <li><a href="/blog/"><i class="fa fa-archive"></i>Blog</a></li>
          <li><a href="/notes/"><i class="fa fa-archive"></i>Notes</a></li>
          <li><a href="/tags/"><i class="fa fa-tag"></i>Tags</a></li>
          <li><a href="/about/"><i class="fa fa-user"></i>About</a></li>
          <li><a href="https://github.com/ZucchiniY"><i class="fa fa-github"></i>GitHub</a></li>
          <li><a href="/rss.xml"><i class="fa fa-rss-square"></i>RSS</a></li>
        </ul>
      </header>
    </div>

<div>
<div class="post">
<h1>Git 合并多次提交</h1>

<div id="outline-container-orgd8a8b3e" class="outline-2">
<h2 id="orgd8a8b3e">合并分支</h2>
<div class="outline-text-2" id="text-orgd8a8b3e">
<p>
develop 分支做开发，可能会进行多次提交，但是在发布或者进行 PR 的时候，我们只希望看到一次提交。这个时候，我们需要进行 `git rebase` 之后进行合并。
</p>

<div class="org-src-container">
<pre class="src src-sh"># HEAD~3 表示将近三次提交都合并，如果是将 2 次合并则为 HEAD~2
git rebase -i HEAD~3
</pre>
</div>

<p>
这个时候，看到的是一上对 <b>COMMIT</b> 信息的提示
</p>

<pre class="example">
pick 9ba5122 2017 年 8 月 2 日
pick c6da035 ~~

# Rebase 9b6bae1..c6da035 onto 9b6bae1 (2 commands)
#
# Commands:
# p, pick = use commit
# r, reword = use commit, but edit the commit message
# e, edit = use commit, but stop for amending
# s, squash = use commit, but meld into previous commit
# f, fixup = like "squash", but discard this commit's log message
# x, exec = run command (the rest of the line) using shell
# d, drop = remove commit
#
# These lines can be re-ordered; they are executed from top to bottom.
#
# If you remove a line here THAT COMMIT WILL BE LOST.
#
# However, if you remove everything, the rebase will be aborted.
#
# Note that empty commits are commented out
</pre>

<p>
第一列对应的是 <code>rebase</code> 具体的操作，其含义如下
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">命令</td>
<td class="org-left">作用</td>
</tr>

<tr>
<td class="org-left">-------------</td>
<td class="org-left">------------------------------</td>
</tr>

<tr>
<td class="org-left">pick(p)</td>
<td class="org-left">git 会应用这个补丁，以同样的提交信息（commit message）保存提交</td>
</tr>

<tr>
<td class="org-left">rewordi(r)</td>
<td class="org-left">git 会应用这个补丁，但需要重新编辑提交信息</td>
</tr>

<tr>
<td class="org-left">edit(e)</td>
<td class="org-left">git 会应用这个补丁，但会因为 amending 而终止</td>
</tr>

<tr>
<td class="org-left">squash(s)</td>
<td class="org-left">git 会应用这个补丁，但会与之前的提交合并</td>
</tr>

<tr>
<td class="org-left">fixup(f)</td>
<td class="org-left">git 会应用这个补丁，但会丢掉提交日志</td>
</tr>

<tr>
<td class="org-left">exec(x)</td>
<td class="org-left">git 会在 shell 中运行这个命令</td>
</tr>

<tr>
<td class="org-left">drop(d)</td>
<td class="org-left">git 会移除这次 COMMIT</td>
</tr>
</tbody>
</table>

<p>
将第二个 <code>pick c6da035 ~~~</code> 这一行修改成 <code>squash c6da035 ~~~</code> ，使之与之前的提交合并。
</p>

<p>
保存之后可以看到下面的内容
</p>

<pre class="example">
 This is a combination of 2 commits.
# This is the 1st commit message:

2017 年 8 月 2 日

删除无用配置，提高启动速度

1. 更新 zucchini-org
2. 增加 CHANGELOG 用来记录每次更新
3. 更新 plantuml 配置
   FIXED Can't find plantuml-jar-path
4. 增加 parinfer 配置，用来优化 lisp 的编写速度

# This is the commit message #2:

~~

# Please enter the commit message for your changes. Lines starting
# with '#' will be ignored, and an empty message aborts the commit.
#
# Date:      Tue Aug 1 10:24:44 2017 +0800
#
# interactive rebase in progress; onto 9b6bae1
# Last commands done (2 commands done):
"~/spacemacs/spacemacs.d/.git/COMMIT_EDITMSG" 36L, 1003C

</pre>

<p>
修改成正确的 commit 信息之后，保存存并退出，可以看到下面的内容
</p>

<div class="org-src-container">
<pre class="src src-sh">$ git rebase -i HEAD~2
[detached HEAD 0238691] 2017 年 8 月 2 日
 Date: Tue Aug 1 10:24:44 2017 +0800
 5 files changed, 65 insertions(+), 34 deletions(-)
 create mode 100644 CHANGELOG.org
 rewrite local/custom.el (66%)
Successfully rebased and updated refs/heads/develop.
</pre>
</div>

<p>
这个时候，就已经将我们这几次的更改都合并到一次中了。
</p>
</div>
</div>

<div id="outline-container-org59f6c6b" class="outline-2">
<h2 id="org59f6c6b">cherry-pick 分支并更新</h2>
<div class="outline-text-2" id="text-org59f6c6b">
<p>
这个时候，就可以更新我们的代码了。
</p>

<p>
首先 <code>git checkout master</code> 分支, 然后更新我们的代码 <code>git pull</code> 。
</p>

<p>
然后将我们合并之后的 <b><b>develop</b></b> 分支的内容更新过来
</p>

<div class="org-src-container">
<pre class="src src-sh">git log -b develop
</pre>
</div>

<p>
看到如下内容
</p>

<pre class="example">
commit 02386914b9e5ab13c23451a3463813bfdecb157a
Author: 语乱 &lt;banshiliuli1990@sina.com&gt;
Date:   Tue Aug 1 10:24:44 2017 +0800

    2017 年 8 月 2 日

    删除无用配置，提高启动速度

    1. 更新 zucchini-org
    2. 增加 CHANGELOG 用来记录每次更新
    3. 更新 plantuml 配置
       FIXED Can't find plantuml-jar-path
    4. 增加 parinfer 配置，用来优化 lisp 的编写速度
</pre>

<p>
或者使用上次的操作的中的提示 <code>[detached HEAD 0238691] 2017 年 8 月 2 日</code>
其中的 <b><b>0238691</b></b> 就是我们需要
</p>

<div class="org-src-container">
<pre class="src src-sh">git cherry-pick 0238691
</pre>
</div>

<p>
这样我们再推送到远程就可以实现合并更新了。
</p>
</div>
</div>

</div>
</div>
    <div>
      <div class="post-meta">
        <span title="post date" class="post-info">2017-08-02</span>
        <span title="last modification date" class="post-info">2018-02-04</span>
        <span title="tags" class="post-info"><a href="/tags/git/">Git</a></span>
        <span title="author" class="post-info">Dylan Yang</span>
      </div>
      <script src="//code.jquery.com/jquery-latest.min.js"></script>
      <script src="https://cdnjs.cloudflare.com/ajax/libs/prettify/r298/prettify.js"></script>
      <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
      <script src="//cdn.bootcss.com/canvas-nest.js/1.0.1/canvas-nest.min.js"></script>
      <script src="/media/js/main.js"></script>
      <div class="footer">
        <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
        <p>
          Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:banshiliuli1990 &lt;at&gt; sina &lt;dot&gt; com">Dylan Yang</a>
          &nbsp;&nbsp;-&nbsp;&nbsp;
          Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
          <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
        </p>
      </div>
    </div>

  </body>
</html>
